Terraform Plan Output:
```
data.oci_identity_compartment.parent: Reading...
data.oci_identity_compartment.parent: Read complete after 1s [id=ocid1.compartment.oc1..aaaaaaaavjic26327yzpleqiu77qvfaxxjobtsuili265urpkh7ac63afo3q]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_identity_compartment.root will be created
  + resource "oci_identity_compartment" "root" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaavjic26327yzpleqiu77qvfaxxjobtsuili265urpkh7ac63afo3q"
      + defined_tags   = (known after apply)
      + description    = "Intermediate Root Compartment for the OpenLZ Project"
      + freeform_tags  = {
          + "Project"   = "OpenLZ"
          + "Team"      = "Industry Cloud"
          + "Terraform" = "true"
        }
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + is_accessible  = (known after apply)
      + name           = "cmp-root-openlz"
      + state          = (known after apply)
      + time_created   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - parent = {
      - compartment_id = "ocid1.tenancy.oc1..aaaaaaaagt7ufsqo7ydlyrzeke6rzxllqtqlhayvhrnoi4vhtyxtq3deo7ia"
      - defined_tags   = {
          - "Oracle-Tags.CreatedBy" = ""
          - "Oracle-Tags.CreatedOn" = ""
        }
      - description    = "Crayon Hungary Compartment"
      - freeform_tags  = {}
      - id             = "ocid1.compartment.oc1..aaaaaaaavjic26327yzpleqiu77qvfaxxjobtsuili265urpkh7ac63afo3q"
      - inactive_state = null
      - is_accessible  = true
      - name           = "HU_compartment"
      - state          = "ACTIVE"
      - time_created   = "2024-05-07 15:47:19.94 +0000 UTC"
    } -> null

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan_output.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan_output.tfplan"

```